Revit 2024 API
IFCExtrusionData Members
The IFCExtrusionData type exposes the following members.
Constructors
Name | Description
IFCExtrusionData
 Constructs a new empty extrusion data object.
Methods
Name | Description
AddLoop
 Adds a curve loop to the extrusion data.
ClearLoops
 Clears the curve loops stored in the extrusion data.
Dispose
Releases all resources used by the IFCExtrusionData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLoops
 Gets the curve loops that form the base shape of the extrusion.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValid
 Determines if the extrusion data represents a valid extrusion.
RemoveLoopAt
 Removes the loop at the specified index.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ExtrusionBasis
 The basis used for the extrusion.
ExtrusionDirection
 The direction used for the extrusion.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ScaledExtrusionLength
 The length of the extrusion, scaled in the units of the export.
See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace